IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_output_xbar_regs.xml
	<register id="OUTPUTINV" width="32" page="1" offset="0x68" internal="0" description="Output X-BAR Output Inversion ">
		<bitfield id="OUTPUT1" description="Selects polarity for OUTPUT1 of OUTPUT-XBAR" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT2" description="Selects polarity for OUTPUT2 of OUTPUT-XBAR" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT3" description="Selects polarity for OUTPUT3 of OUTPUT-XBAR" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT4" description="Selects polarity for OUTPUT4 of OUTPUT-XBAR" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT5" description="Selects polarity for OUTPUT5 of OUTPUT-XBAR" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT6" description="Selects polarity for OUTPUT6 of OUTPUT-XBAR" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT7" description="Selects polarity for OUTPUT7 of OUTPUT-XBAR" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="OUTPUT8" description="Selects polarity for OUTPUT8 of OUTPUT-XBAR" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="OUTPUTLOCK" width="32" page="1" offset="0x6e" internal="0" description="Output X-BAR Configuration Lock register">
		<bitfield id="LOCK" description="Locks the configuration for OUTPUT-XBAR" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Write Protection KEY" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
</module>
